# Subqueries and CTEs in SQL

## Introduction

Subqueries and Common Table Expressions (CTEs) are advanced SQL techniques used to build structured, modular, and readable queries.

They allow complex logic to be broken into smaller, logical steps, improving clarity and maintainability.

Subqueries are nested queries executed within another query, while CTEs provide a temporary result set that can be referenced multiple times within a statement.

These concepts are widely used in analytical SQL for filtering, transformation, ranking, and layered data processing.

---

## Topics Covered

- Subqueries (Simple and Correlated)
- Common Table Expressions (CTEs)
- Multiple CTEs
- Replacing Subqueries with CTEs
- Performance and readability considerations

### Database Connection

In [1]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:Bhavesh%402025@localhost/customers

### Subquery in WHERE

### Employees earning above company average

In [4]:
%%sql
select name ,salary from employees where 
salary>(select avg(salary) from employees);

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Rahul', 85000), ('Suresh', 75000), ('Vikram', 65000)]

### Employees who received bonus

In [5]:
%%sql 
select name from employees 
where employee_id in (select employee_id from salaries)

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('Amit',), ('Rahul',), ('Suresh',), ('Anita',), ('Vikram',)]

### Employees working in departments with manager 'Rajesh Kumar'

In [6]:
%%sql 
select name from employees
where department =
(select department_name from departments
where manager_name='Rajesh Kumar')

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Amit',), ('Rahul',), ('Suresh',)]

### Subquery in FROM (Derived Table)

### Department average salary

In [16]:
%%sql
select department,avg_salary 
from (select department,avg(salary) as avg_salary 
from employees 
group by department)avg_dept

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('IT', Decimal('73333.3333')),
 ('HR', Decimal('45000.0000')),
 ('Finance', Decimal('57500.0000')),
 ('Marketing', Decimal('55000.0000')),
 ('Sales', Decimal('48000.0000'))]

### Departments with avg salary > 60000

In [18]:
%%sql 
select department from 
(select department,avg(salary) as avg_salary
                       from employees group by department 
)avg_dept where avg_salary > 60000

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[('IT',)]

### Total compensation per employee (salary + bonus)

In [23]:
%%sql 
select name,total_com
from(select e.name ,e.salary + coalesce(s.bonus,0) as total_com
from employees e left join salaries s
on e.employee_id = s.employee_id)comp_data

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 65000),
 ('Neha', 45000),
 ('Rahul', 97000),
 ('Priya', 50000),
 ('Suresh', 83000),
 ('Anita', 59000),
 ('Vikram', 71000),
 ('Rohit', 48000)]

### Subquery in SELECT (Scalar Subquery)

### Show company average salary in every row

In [28]:
%%sql 
select name,salary,
(select avg(salary) as avg_salary from employees )as avg_salary
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 60000, Decimal('60375.0000')),
 ('Neha', 45000, Decimal('60375.0000')),
 ('Rahul', 85000, Decimal('60375.0000')),
 ('Priya', 50000, Decimal('60375.0000')),
 ('Suresh', 75000, Decimal('60375.0000')),
 ('Anita', 55000, Decimal('60375.0000')),
 ('Vikram', 65000, Decimal('60375.0000')),
 ('Rohit', 48000, Decimal('60375.0000'))]

### Show total employee count in every row

In [29]:
%%sql 
select name,
(select count(*) from employees)as count
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 8),
 ('Neha', 8),
 ('Rahul', 8),
 ('Priya', 8),
 ('Suresh', 8),
 ('Anita', 8),
 ('Vikram', 8),
 ('Rohit', 8)]

### Correlated Subqueries (Advanced)

### Employees earning above department average

In [30]:
%%sql 
select e.name,e.salary,e.department 
from employees e 
where e.salary >(select avg(salary) from employees where department = e.department)

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Rahul', 85000, 'IT'), ('Suresh', 75000, 'IT'), ('Vikram', 65000, 'Finance')]

### Employees who earn highest salary in their department

In [32]:
%%sql
select e.name,e.salary,e.department 
from employees e 
where e.salary = (select max(salary) from employees where department = e.department)

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('Neha', 45000, 'HR'),
 ('Rahul', 85000, 'IT'),
 ('Anita', 55000, 'Marketing'),
 ('Vikram', 65000, 'Finance'),
 ('Rohit', 48000, 'Sales')]

### Employees who have bonus greater than department avg bonus

In [38]:
%%sql 
select e.name ,s.bonus 
from employees e 
join salaries s 
on e.employee_id = s.employee_id
where s.bonus > (select avg(s2.bonus) 
        from employees e2 
        join salaries s2 
        on e2.employee_id=s2.employee_id
        where e2.department=e.department)

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[('Rahul', 12000)]

## CTE (Common Table Expression)

CTE improves readability.

Syntax:

WITH cte_name AS (  
    query  
)  
SELECT * FROM cte_name;

### Example 1: Department average salary

In [41]:
%%sql 
with dept_avg as (
    select avg(salary) as avg_salary ,department
    from employees group by department 
) select * from dept_avg

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[(Decimal('73333.3333'), 'IT'),
 (Decimal('45000.0000'), 'HR'),
 (Decimal('57500.0000'), 'Finance'),
 (Decimal('55000.0000'), 'Marketing'),
 (Decimal('48000.0000'), 'Sales')]

### Example 2: Employees above department average

In [43]:
%%sql 
with dept_avg as (
    select department,avg(salary) as avg_salary 
    from employees group by department 
) select e.name,e.department,e.salary
from employees e 
join dept_avg d 
on e.department = d.department
where e.salary > d.avg_salary

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Suresh', 'IT', 75000), ('Rahul', 'IT', 85000), ('Vikram', 'Finance', 65000)]

### Example 3: Employees with total compensation

In [44]:
%%sql 
WITH comp_data AS (
    SELECT e.employee_id,
           e.name,
           e.salary,
           COALESCE(s.bonus,0) AS bonus
    FROM employees e
    LEFT JOIN salaries s
    ON e.employee_id = s.employee_id
)
SELECT name,
       salary,
       bonus,
       salary + bonus AS total_compensation
FROM comp_data;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 60000, 5000, 65000),
 ('Neha', 45000, 0, 45000),
 ('Rahul', 85000, 12000, 97000),
 ('Priya', 50000, 0, 50000),
 ('Suresh', 75000, 8000, 83000),
 ('Anita', 55000, 4000, 59000),
 ('Vikram', 65000, 6000, 71000),
 ('Rohit', 48000, 0, 48000)]

### Multiple CTEs (Industry Level)

### Example 1: Department salary & bonus summary

In [46]:
%%sql
WITH salary_data AS (
    SELECT department, SUM(salary) AS total_salary
    FROM employees
    GROUP BY department
),
bonus_data AS (
    SELECT e.department,
           SUM(COALESCE(s.bonus,0)) AS total_bonus
    FROM employees e
    LEFT JOIN salaries s
    ON e.employee_id = s.employee_id
    GROUP BY e.department
)
SELECT s.department,
       s.total_salary,
       b.total_bonus
FROM salary_data s
JOIN bonus_data b
ON s.department = b.department;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('IT', Decimal('220000'), Decimal('25000')),
 ('HR', Decimal('45000'), Decimal('0')),
 ('Finance', Decimal('115000'), Decimal('6000')),
 ('Marketing', Decimal('55000'), Decimal('4000')),
 ('Sales', Decimal('48000'), Decimal('0'))]

### Example 2: Top 2 highest salaries using CTE

In [50]:
%%sql 
with rank_slaries as (select 
                 name,salary
from employees order by salary decs 
limit 2)select * from rank_slaries

 * mysql+pymysql://root:***@localhost/customers
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'decs \nlimit 2)select * from rank_slaries' at line 3")
[SQL: with rank_slaries as (select
                 name,salary
from employees order by salary decs
limit 2)select * from rank_slaries]
(Background on this error at: https://sqlalche.me/e/20/f405)